import Verbose.Russian.ExampleLib
import Verbose.Russian.Statements

set_option linter.unusedTactic false

Упражнение "Непрерывность влечёт секвенциальную непрерывность."
  Дано: (f : ℝ → ℝ) (u : ℕ → ℝ) (x₀ : ℝ)
  Предположения: (hu : u стремится к x₀) (hf : f непрерывна в x₀)
  Заключение: f ∘ u стремится к f x₀
Доказательство:
  Докажем, что ∀ ε > 0, ∃ N, ∀ n ≥ N, |f (u n) - f x₀| ≤ ε
  Пусть ε > 0
  По hf применённый к ε используя, что ε > 0 получаем δ такой, что
    (δ_pos : δ > 0) и (Hf : ∀ x, |x - x₀| ≤ δ ⇒ |f x - f x₀| ≤ ε)
  По hu применённый к δ используя, что δ > 0 получаем N такой, что Hu : ∀ n ≥ N, |u n - x₀| ≤ δ
  Докажем, что N подходит: ∀ n ≥ N, |f (u n) - f x₀| ≤ ε
  Пусть n ≥ N
  По Hf применённый к u n достаточно доказать, что |u n - x₀| ≤ δ
  Заключаем по Hu применённый к n используя, что n ≥ N
ЧТД

-- Вариант без указания имён гипотез
Упражнение "Непрерывность влечёт секвенциальную непрерывность."
  Дано: (f : ℝ → ℝ) (u : ℕ → ℝ) (x₀ : ℝ)
  Предположения: (hu : u стремится к x₀) (hf : f непрерывна в x₀)
  Заключение: f ∘ u стремится к f x₀
Доказательство:
  Докажем, что ∀ ε > 0, ∃ N, ∀ n ≥ N, |f (u n) - f x₀| ≤ ε
  Пусть ε > 0
  Поскольку f непрерывна в x₀ и ε > 0 получаем δ такой, что
    δ > 0 и ∀ x, |x - x₀| ≤ δ ⇒ |f x - f x₀| ≤ ε
  Поскольку u стремится к x₀ и δ > 0 получаем N такой, что ∀ n ≥ N, |u n - x₀| ≤ δ
  Докажем, что N подходит: ∀ n ≥ N, |f (u n) - f x₀| ≤ ε
  Пусть n ≥ N
  Поскольку ∀ x, |x - x₀| ≤ δ → |f x - f x₀| ≤ ε достаточно доказать, что |u n - x₀| ≤ δ
  Поскольку ∀ n ≥ N, |u n - x₀| ≤ δ и n ≥ N заключаем, что |u n - x₀| ≤ δ
ЧТД

Пример "Постоянные последовательности сходятся."
  Дано: (u : ℕ → ℝ) (l : ℝ)
  Предположения: (h : ∀ n, u n = l)
  Заключение: u стремится к l
Доказательство:
  Пусть ε > 0
  Докажем, что ∃ N, ∀ n ≥ N, |u n - l| ≤ ε
  Докажем, что 0 подходит
  Пусть n ≥ 0
  Calc |u n - l| = |l - l| из h
   _             = 0       вычислением
   _             ≤ ε       из ε_pos
ЧТД

Пример "Последовательность, стремящаяся к строго положительному пределу, в конце концов строго положительна."
  Дано: (u : ℕ → ℝ) (l : ℝ)
  Предположения: (hl : l > 0) (h : u стремится к l)
  Заключение: ∃ N, ∀ n ≥ N, u n ≥ l/2
Доказательство:
  По h применённый к l/2 используя, что l/2 > 0 получаем N такой, что (hN : ∀ n ≥ N, |u n - l| ≤ l / 2)
  Докажем, что N подходит
  Пусть n ≥ N
  По hN применённый к n используя, что n ≥ N получаем hN' : |u n - l| ≤ l / 2
  По hN' получаем (h₁ : -(l / 2) ≤ u n - l) (h₂ : u n - l ≤ l / 2)
  Заключаем по h₁
ЧТД

open Verbose.Named in
Пример "Сложение сходящихся последовательностей."
  Дано: (u v : ℕ → ℝ) (l l' : ℝ)
  Предположения: (hu : u стремится к l) (hv : v стремится к l')
  Заключение: (u + v) стремится к (l + l')
Доказательство:
  Пусть ε > 0
  По hu применённый к ε/2 используя, что ε/2 > 0 получаем N₁
      такой, что (hN₁ : ∀ (n : ℕ), n ≥ N₁ → |u n - l| ≤ ε / 2)
  По hv применённый к ε/2 используя, что ε/2 > 0 получаем N₂
      такой, что (hN₂ : ∀ n ≥ N₂, |v n - l'| ≤ ε / 2)
  Докажем, что max N₁ N₂ подходит
  Пусть n ≥ max N₁ N₂
  По n_ge получаем (hn₁ : N₁ ≤ n) (hn₂ : N₂ ≤ n)
  Утверждение fact1 : |u n - l|  ≤ ε/2 из hN₁ применённый к n используя hn₁
  Утверждение fact2 : |v n - l'| ≤ ε/2 из hN₂ применённый к n используя hn₂
  Calc
  |(u + v) n - (l + l')| = |(u n - l) + (v n - l')| вычислением
                     _   ≤ |u n - l| + |v n - l'|   из abs_add_le
                     _   ≤  ε/2 + ε/2               из fact1 и из fact2
                     _   ≤  ε                       вычислением
ЧТД

Пример "Теорема о двух милиционерах."
  Дано: (u v w : ℕ → ℝ) (l : ℝ)
  Предположения:
    (hu : u стремится к l) (hw : w стремится к l)
    (h : ∀ n, u n ≤ v n) (h' : ∀ n, v n ≤ w n)
  Заключение: v стремится к l
Доказательство:
  Пусть ε > 0
  Докажем, что ∃ N, ∀ n ≥ N, |v n - l| ≤ ε
  Поскольку u стремится к l и ε > 0 получаем N такой, что ∀ n ≥ N, |u n - l| ≤ ε
  Поскольку w стремится к l и ε > 0 получаем N' такой, что ∀ n ≥ N', |w n - l| ≤ ε
  Докажем, что max N N' подходит: ∀ n ≥ max N N', |v n - l| ≤ ε
  Пусть n ≥ max N N'
  Поскольку ∀ n ≥ N, |u n - l| ≤ ε и n ≥ N получаем, что |u n - l| ≤ ε
  Поскольку ∀ n ≥ N', |w n - l| ≤ ε и n ≥ N' получаем, что |w n - l| ≤ ε
  Докажем сначала, что -ε ≤ v n - l
  Calc -ε ≤ u n - l поскольку |u n - l| ≤ ε
      _   ≤ v n - l поскольку u n ≤ v n
  Докажем теперь, что v n - l ≤ ε
  Calc v n - l ≤ w n - l поскольку v n ≤ w n
      _        ≤ ε       поскольку |w n - l| ≤ ε
ЧТД

open Verbose.Named in
Пример "Переформулировка определения предела."
  Дано: (u : ℕ → ℝ) (l : ℝ)
  Предположения:
  Заключение: (u стремится к l) ⇔ ∀ ε > 0, ∃ N, ∀ n ≥ N, |u n - l| < ε
Доказательство:
  Докажем сначала, что (u стремится к l) ⇒ ∀ ε > 0, ∃ N, ∀ n ≥ N, |u n - l| < ε
  Предположим hyp : u стремится к l
  Пусть ε > 0
  По hyp применённый к ε/2 используя, что ε/2 > 0 получаем N
      такой, что hN : ∀ n ≥ N, |u n - l| ≤ ε / 2
  Докажем, что N подходит
  Пусть n ≥ N
  Calc |u n - l| ≤ ε/2 из hN применённый к n используя, что n ≥ N
       _         < ε   из ε_pos
  Докажем теперь, что (∀ ε > 0, ∃ N, ∀ n ≥ N, |u n - l| < ε) ⇒ u стремится к l
  Предположим hyp : ∀ ε > 0, ∃ N, ∀ n ≥ N, |u n - l| < ε
  Пусть ε > 0
  По hyp применённый к ε используя, что ε > 0 получаем N такой, что hN : ∀ n ≥ N, |u n - l| < ε
  Докажем, что N подходит
  Пусть n ≥ N
  Заключаем по hN применённый к n используя, что n ≥ N
ЧТД

Пример "Единственность предела последовательности."
  Дано: (u : ℕ → ℝ) (l l' : ℝ)
  Предположения: (h : u стремится к l) (h' : u стремится к l')
  Заключение: l = l'
Доказательство:
  По eq_of_forall_dist_le достаточно доказать, что ∀ ε > 0, |l - l'| ≤ ε
  Пусть ε > 0
  По h применённый к ε/2 используя, что ε/2 > 0 получаем N
      такой, что hN : ∀ n ≥ N, |u n - l| ≤ ε / 2
  По h' применённый к ε/2 используя, что ε/2 > 0 получаем N'
      такой, что hN' : ∀ n ≥ N', |u n - l'| ≤ ε / 2
  По hN применённый к max N N' используя le_max_left _ _
     получаем hN₁ : |u (max N N') - l| ≤ ε / 2
  По hN' применённый к max N N' используя le_max_right _ _
    получаем hN'₁ : |u (max N N') - l'| ≤ ε / 2
  Calc |l - l'| = |(l-u (max N N')) + (u (max N N') -l')|  вычислением
    _           ≤ |l - u (max N N')| + |u (max N N') - l'| из abs_add_le
    _           = |u (max N N') - l| + |u (max N N') - l'| из abs_sub_comm
    _           ≤  ε/2 + ε/2                               из hN₁ и из hN'₁
    _           = ε                                        вычислением
ЧТД

Пример "Возрастающая последовательность с конечным супремумом стремится к нему."
  Дано: (u : ℕ → ℝ) (M : ℝ)
  Предположения: (h : M является супремумом u) (h' : u возрастает)
  Заключение: u стремится к M
Доказательство:
  Пусть ε > 0
  По h получаем (inf_M : ∀ (n : ℕ), u n ≤ M)
                   (sup_M_ep : ∀ ε > 0, ∃ (n₀ : ℕ), u n₀ ≥ M - ε)
  По sup_M_ep применённый к ε используя, что ε > 0 получаем n₀ такой, что hn₀ : u n₀ ≥ M - ε
  Докажем, что n₀ подходит: ∀ n ≥ n₀, |u n - M| ≤ ε
  Пусть n ≥ n₀
  По inf_M применённый к n получаем (inf_M' : u n ≤ M)
  Докажем сначала, что -ε ≤ u n - M
  · По h' применённый к n₀ и n используя n_ge получаем h'' : u n₀ ≤ u n
    Calc
      -ε ≤ u n₀ - M из hn₀
      _  ≤ u n - M из h''
  Докажем теперь, что u n - M ≤ ε
  · Calc
     u n - M ≤ M - M из inf_M'
     _       = 0     вычислением
     _       ≤ ε     из ε_pos
ЧТД
